tap "sikarugir-app/sikarugir", "https://github.com/Sikarugir-App/homebrew-sikarugir", trusted: true
# Simple, modern, secure file encryption
brew "age"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Cross-platform make
brew "cmake"
# More intuitive version of du in rust
brew "dust"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# Linux virtual machines
brew "lima"
# Sign files & verify signatures. Works with signify in OpenBSD
brew "minisign"
# Lightweight cloud messaging system
brew "nats-server"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Fast, disk space efficient package manager
brew "pnpm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# Command-line interface for SQLite
brew "sqlite"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# 3D creation suite
cask "blender"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Web browser
cask "firefox@developer-edition"
# Web browser
cask "google-chrome"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Porting tool, to make Windows programs/games into native apps
cask "sikarugir-app/sikarugir/sikarugir"
# Open-source code editor
cask "visual-studio-code"
vscode "a-h.templ"
vscode "antfu.iconify"
vscode "bradlc.vscode-tailwindcss"
vscode "golang.go"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "runem.lit-plugin"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/gopls"
go "golang.org/x/vuln/cmd/govulncheck"
npm "corepack"
